---
title: ReferenceArrayArray
classe: Autodesk.Revit.DB.ReferenceArrayArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ReferenceArrayArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `referenceArrayArray.IsEmpty` | Boolean |
| `ReferenceArray Item { get; set; }` | `referenceArrayArray.Item` | ReferenceArray |
| `Int32 Size { get; }` | `referenceArrayArray.Size` | Int32 |
| `Void Append(ReferenceArray)` | `referenceArrayArray.Append(item)` | Void |
| `Void Clear()` | `referenceArrayArray.Clear()` | Void |
| `ReferenceArrayArrayIterator ForwardIterator()` | `referenceArrayArray.ForwardIterator()` | ReferenceArrayArrayIterator |
| `IEnumerator GetEnumerator()` | `referenceArrayArray.GetEnumerator()` | IEnumerator |
| `Void Insert(ReferenceArray, Int32)` | `referenceArrayArray.Insert(item, index)` | Void |
| `ReferenceArrayArrayIterator ReverseIterator()` | `referenceArrayArray.ReverseIterator()` | ReferenceArrayArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```